Arr62/STM32/poziomica_cyfrowa/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define Led_R1_Pin GPIO_PIN_6
#define Led_R1_GPIO_Port GPIOA
#define Led_Y2_Pin GPIO_PIN_7
#define Led_Y2_GPIO_Port GPIOA
#define Led_Y11_Pin GPIO_PIN_10
#define Led_Y11_GPIO_Port GPIOB
#define Led_R2_Pin GPIO_PIN_6
#define Led_R2_GPIO_Port GPIOC
#define Led_G2_Pin GPIO_PIN_7
#define Led_G2_GPIO_Port GPIOC
#define Led_R3_Pin GPIO_PIN_8
#define Led_R3_GPIO_Port GPIOC
#define Led_G22_Pin GPIO_PIN_8
#define Led_G22_GPIO_Port GPIOA
#define Led_G1_Pin GPIO_PIN_9
#define Led_G1_GPIO_Port GPIOA
#define Led_R33_Pin GPIO_PIN_10
#define Led_R33_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define Led_R22_Pin GPIO_PIN_3
#define Led_R22_GPIO_Port GPIOB
#define Led_Y22_Pin GPIO_PIN_4
#define Led_Y22_GPIO_Port GPIOB
#define Led_R11_Pin GPIO_PIN_5
#define Led_R11_GPIO_Port GPIOB
#define Led_Y1_Pin GPIO_PIN_6
#define Led_Y1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
